Revit 2027 API
ElectricalPerPhaseData.CurrentPhaseC Property
 The effective value of current on electrical phase C.
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double CurrentPhaseC { get; }
Public ReadOnly Property CurrentPhaseC As Double
	Get
public:
property double CurrentPhaseC {
	double get ();
}
member CurrentPhaseC : float with get
Property Value
Double
See Also
Reference
ElectricalPerPhaseData Class
Autodesk.Revit.DB.Electrical Namespace